In [1]:
import duckdb
import pandas as pd

prices = pd.read_csv("prices.csv")

def run_sql(query):
    return duckdb.query(query).to_df()

1. How many rows are in the prices table?

In [2]:
run_sql("""
SELECT
    count(*)
FROM prices;
""")

   count_star()
0           390

2. What is the average closing price across all tickers?

In [3]:
run_sql("""
SELECT ROUND(AVG(close), 2)
FROM prices;
""")

   round(avg("close"), 2)
0                  299.48

3. For each ticker, calculate:

- average close price

- total traded volume

In [4]:
run_sql("""
SELECT 
ticker,
ROUND(AVG(close), 2) AS avg_close,
SUM(volume) AS total_volume
FROM prices
GROUP BY ticker;
""")

  ticker  avg_close  total_volume
0   MSFT     148.01   405789036.0
1   GOOG     243.44   382805207.0
2   NVDA     507.00   387226312.0

4. For each ticker, compute:

- highest high

- lowest low

- average daily volume

In [5]:
run_sql("""
SELECT 
ticker,
MAX(high) AS avg_close,
MIN(low) AS lowest_low,
AVG(volume) AS average_daily_volume
FROM prices
GROUP BY ticker;
""")

  ticker  avg_close  lowest_low  average_daily_volume
0   GOOG     255.97      226.27          2.944655e+06
1   NVDA     516.96      482.71          2.978664e+06
2   MSFT     174.56      126.86          3.121454e+06

5. For each date, calculate total volume traded across all tickers.

In [6]:
run_sql("""
SELECT 
SUM(volume) AS total_volume
FROM prices
GROUP BY date;
""")

     total_volume
0       7379315.0
1       9221783.0
2       5974733.0
3       9185494.0
4       6702650.0
..            ...
125     7592402.0
126    12385903.0
127     8040150.0
128    13114842.0
129    10326457.0

[130 rows x 1 columns]

6. Calculate the average close price per ticker only for dates after 2024-03-01.

In [7]:
run_sql("""
SELECT
ticker,
ROUND(AVG(close), 2) AS average_close
FROM prices
WHERE date > '2024-03-01'
GROUP BY ticker;
""")

  ticker  average_close
0   MSFT         143.21
1   GOOG         241.48
2   NVDA         509.06

7. Show tickers whose average close price is greater than 300.

In [12]:
run_sql("""
SELECT
ticker,
ROUND(AVG(close), 2) AS average_close
FROM prices
GROUP BY ticker
HAVING average_close > 300;
""")

  ticker  average_close
0   NVDA          507.0

8. For each ticker, compute:

- avg close as avg_close

- max volume as max_volume

- order by avg_close descending.

In [14]:
run_sql("""
SELECT
ticker,
ROUND(AVG(close), 2) AS average_close,
MAX(volume) AS max_volume
FROM prices
GROUP BY ticker
ORDER BY average_close DESC;
""")

  ticker  average_close  max_volume
0   NVDA         507.00     4995609
1   GOOG         243.44     4912942
2   MSFT         148.01     4963735

9. Why does this query fail?

            *SELECT ticker, close

            FROM prices

            GROUP BY ticker;*

The query fails because the close column is not in an aggregation function or in the group by clause.

10. Explain the difference between:

            WHERE volume > 2000000


and

            HAVING SUM(volume) > 2000000

The WHERE clause fliters data by rows; before the aggregation. In contrast, the HAVING clause filters data by groups; after the aggregation.